package hw4;


import hw4.Solutions.Task1;


public class Main {
    public static void main(String[] args) {

        // (✔решено) 1. Пусть дан LinkedList с несколькими элементами. Реализуйте метод, который вернет “перевернутый” список.
        // (✔решено) 2. Реализуйте очередь с помощью LinkedList со следующими методами:enqueue() - помещает элемент в
        // конец очереди, dequeue() - возвращает первый элемент из очереди и удаляет его, first() - возвращает первый
        // элемент из очереди, не удаляя.

        // P.S. Решение сделано на основе кода, взятого из семинара, дополнив в switch case "REVERSE", "POP1", "FIRST"
        // Надеюсь такая работа считается)

        Task1.run();
    }
}
